---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CircuitNamingScheme
source: html/99de5fb2-6e65-7b1f-1866-347c40d427af.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNamingScheme

This class represents a circuit naming scheme in Autodesk Revit.

## Syntax (C#)
```csharp
public class CircuitNamingScheme : Element
```